; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared6 - mode
	image2 - mode
	infrared0 - mode
	spectrograph4 - mode
	image5 - mode
	spectrograph7 - mode
	spectrograph3 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared6)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph7)
	(supports instrument0 image5)
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star5 infrared0)
	(have_image Phenomenon6 image2)
	(have_image Planet7 image5)
	(have_image Planet7 infrared0)
	(have_image Planet8 thermograph1)
	(have_image Planet8 infrared0)
	(have_image Planet9 infrared6)
	(have_image Star10 infrared6)
	(have_image Planet11 infrared6)
	(have_image Planet11 spectrograph7)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 star10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star10)
   goals met: 0 of 11
5. (take_image satellite0 star10 instrument0 infrared6)
   added: (have_image star10 infrared6)
   goals met: 1 of 11
6. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 1 of 11
7. (take_image satellite0 planet9 instrument0 infrared6)
   added: (have_image planet9 infrared6)
   goals met: 2 of 11
8. (turn_to satellite0 planet11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet11)
   goals met: 2 of 11
9. (take_image satellite0 planet11 instrument0 spectrograph7)
   added: (have_image planet11 spectrograph7)
   goals met: 3 of 11
10. (take_image satellite0 planet11 instrument0 infrared6)
   added: (have_image planet11 infrared6)
   goals met: 4 of 11
11. (turn_to satellite0 phenomenon6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 11
12. (take_image satellite0 phenomenon6 instrument0 image2)
   added: (have_image phenomenon6 image2)
   goals met: 5 of 11
13. (turn_to satellite0 planet7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet7)
   goals met: 5 of 11
14. (take_image satellite0 planet7 instrument0 image5)
   added: (have_image planet7 image5)
   goals met: 6 of 11
15. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 7 of 11
16. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 7 of 11
17. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 8 of 11
18. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 9 of 11
19. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 10 of 11
20. (take_image satellite0 star5 instrument0 infrared0)
   added: (have_image star5 infrared0)
   goals met: 11 of 11
